In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame([[1,2],[3,4],[5,6],[7,8]], index=['R1','R2','R3','R4'], columns=['C1','C2'])

In [4]:
df

    C1  C2
R1   1   2
R2   3   4
R3   5   6
R4   7   8

In [14]:
vf = pd.DataFrame()
vf['C1'] = [1,2,3,4,5]
vf['C2'] = [6,7,8,9,0]
vf.index = ['R1','R2','R3','R4','R5']
vf

    C1  C2
R1   1   6
R2   2   7
R3   3   8
R4   4   9
R5   5   0

In [15]:
bvf = vf[vf<5]
bvf

     C1   C2
R1  1.0  NaN
R2  2.0  NaN
R3  3.0  NaN
R4  4.0  NaN
R5  NaN  0.0

In [16]:
bvf.T

     R1   R2   R3   R4   R5
C1  1.0  2.0  3.0  4.0  NaN
C2  NaN  NaN  NaN  NaN  0.0

In [17]:
df.describe()

             C1        C2
count  4.000000  4.000000
mean   4.000000  5.000000
std    2.581989  2.581989
min    1.000000  2.000000
25%    2.500000  3.500000
50%    4.000000  5.000000
75%    5.500000  6.500000
max    7.000000  8.000000

In [19]:
df.drop('C2',axis=1)

    C1
R1   1
R2   3
R3   5
R4   7

In [21]:
vf.sort_values(by='C2')

    C1  C2
R5   5   0
R1   1   6
R2   2   7
R3   3   8
R4   4   9

In [23]:
vf.sort_index(axis=1)

    C1  C2
R1   1   6
R2   2   7
R3   3   8
R4   4   9
R5   5   0

In [26]:
vf.iloc[2][1]

8

In [27]:
df.iloc[1]['C2']

4

In [28]:
pd.DataFrame(np.random.randn(10,4))

          0         1         2         3
0 -0.867529  0.057093  1.112082  1.265328
1  0.053076  0.145563 -0.322383 -0.500781
2  0.041910 -0.387027 -1.381687  0.035050
3  0.812978  0.249614  1.001107  1.083776
4 -2.157448 -0.982096  1.334000 -0.438797
5  0.035862  0.267034 -0.379228 -0.886212
6  0.773268  1.164457  1.576968  0.336113
7  0.693484 -0.167905 -0.867919 -0.025546
8  1.599622 -1.104356  1.131468  0.387896
9 -0.193731 -1.770554 -0.437577 -0.158668